[
  {
    "path": "posts/dataviz-makeover-1/",
    "title": "DataViz Makeover 1",
    "description": "This data visualisation presents the growth of Singapore's Labour Force Participation Rate (LFPR) from 2009 to 2019.",
    "author": [
      {
        "name": "Andy WONG",
        "url": "https://www.linkedin.com/in/andywongkh"
      }
    ],
    "date": "2021-01-28",
    "categories": [],
    "contents": "\r\n1.0 Overview\r\n1.1 Mapping clarity vs aesthetics\r\nThe chart provided in the DataViz Makeover assignment 1 overall looks somewhat aesthetically pleasing, but is unclear on the details of the chart. Based on this, the chart falls into Quadrant IV of the matrix:\r\n\r\n\r\n\r\nFigure 1: Clarity vs Aesthetics matrix Source of matrix: https://dataremixed.com/2012/05/data-visualization-clarity-or-aesthetics.Source of graph: https://stats.mom.gov.sg/Pages/Labour-Force-In-Singapore-2019.aspx\r\n\r\n\r\n\r\n2.0 The Makeover\r\n2.1 Critique of the visualisation and suggested improvements\r\n2.1.1 Clarity\r\nS/n\r\nCritique\r\nSuggestions for improvement\r\n1\r\nUnclear Subtitle. It is not clear what the subtitle “Per Cent” refers to. It looks to almost be put there as an afterthought.\r\nRemove the subtitle altogether and label the appropriate axis with “%”. This will reduce extra text, and still present the percentage values in a more intuitive manner.\r\n2\r\nX-axis is not explained. There are no labels to explain what the three types of values on the x axis mean.\r\nPivot the data such that the percentages are on the x-axis and the age group is on the y-axis, and label the axes accordingly. This will improve the clarity of the visualisation.\r\n3\r\nUnclear presentation of age group information. It would be clearer if percentage was presented on the y axis instead of the x axis, as the x axis is usually used to present time period. Together with the blue and grey lines in the line graph, it intuitively looked as though to present as a timeline; only upon further examination was it understood to be meant to present age proportion in percentage.\r\nPivot the data such that age group is presented on the y axis, as the x axis is usually used to present time period. This will make the visualization more intuitive to the reader.\r\n4\r\nDuplicate presentation of information. The two lines in the line graph essentially present the same information as the percentage values for June 2009 and June 2019 in the x-axis. The line graph provided the visual trend, while the percentage values in the a-axis provided the actual percentage values. This duplication would not be needed with better visualization design.\r\nRemove the June 2009 and June 2019 percentage values on the x-axis. This will no longer be necessary if the data is presented appropriately.\r\n2.1.2 Aesthetics\r\nS/n\r\nCritique\r\nSuggestions for improvement\r\n1\r\nGood use of colour to differentiate the 2 time periods. A more contrasting colour scheme might be better.\r\nTo use two more appealing colours to enhance the contrast and clarity of the 2 sets of data being compared.\r\n2\r\nClear labeling of what the two lines in the line graph represent, and the median ages. However, better designed aesthetics could allow for more concise labels (use less words).\r\nInclude labels as necessary.\r\n3\r\nWith 3 different values, the x-axis is too cluttered.\r\nThis will be solved when the data is pivoted appropriately, as mentioned above.\r\n4\r\nAs a minor point: although best practice states that number ranges should start with 0, there is no need for the age group to start from 0 as this graph is to present the labour force which is consists of all persons aged 15 years and over (https://stats.mom.gov.sg/SL/Pages/Labour-Force-Introduction.aspx). The age group still covers the entire range of legal working age ranges so it is sufficient.\r\nNo action necessary.\r\n2.2 Sketch of the alternative visualisation\r\nSketch of the alternative visualisation2.3 Building the visualisation\r\nThis visualisation was built using Tableau Desktop Professional Edition 2020.4.0.\r\nS/n\r\nStep\r\nAction\r\n1\r\nImport data into Tableau\r\nImport Excel file into Tableau \r\n2\r\nClean the data\r\nThe data is not standardized and clean, because the formatting of the spreadsheet is not friendly for data importation. \r\n3\r\nClean the data\r\nClicking on the “Cleaned with Data Interpreter” will clean up the data significantly and allow for easier cleaning. \r\n4\r\nClean the data\r\nHide the left-most column as it is not useful for this analysis. \r\n5\r\nClean the data\r\nRename “Age (Years) 1” column to “Age Group” for clarity. \r\n6\r\nClean the data\r\nCheck that “Age” column is of the correct data type (string). \r\n7\r\nClean the data\r\nCheck that the rest of the year columns are of the correct data type (Number[decimal]). \r\n8\r\nBuild the visualisation\r\nDrag “2009” and “2019” to the Columns pane.\r\n9\r\nBuild the visualisation\r\nDrag “Age Group” to the Rows pane. \r\n10\r\nBuild the visualisation\r\nExclude “NULL” and “Total” columns from the chart, as these are not useful for the analysis.\r\n11\r\nBuild the visualisation\r\nExclude overlapping age groups, as these will confuse the data presented in the visualisation. \r\n12\r\nBuild the visualisation\r\nSort Age Group in descending order.\r\n13\r\nBuild the visualisation\r\nSelect “Dual Axis” to combine the two charts into one. \r\n14\r\nBuild the visualisation\r\nSelect “Synchronise Axis” to ensure both charts’ axes match. \r\n15\r\nBuild the visualisation\r\nRemove “Show Header” to show only one y-axis. \r\n16\r\nBuild the visualisation\r\nChange the 2019 Mark to Bar chart. \r\n17\r\nBuild the visualisation\r\nSwap “SUM(2019)” to the front of the Columns pane to display the 2019 chart behind the 2009 chart. \r\n18\r\nBuild the visualisation\r\nEdit the range of the x-axis to show the whole range of 0% to 100%. Rename label as “LFPR(%)”. \r\n19\r\nBuild the visualisation\r\nChange the view to “Entire View” for visual clarity. \r\n20\r\nBuild the visualisation\r\nEdit the chart title. \r\n21\r\nBuild the visualisation\r\nEdit the Legend title to “Year”. \r\n22\r\nBuild the visualisation\r\nRename the Sheet. \r\n23\r\nBuild the visualisation\r\nThe completed chart looks like this: \r\n2.4 Some key observations from the visualisation\r\nS/n\r\nObservation\r\n1\r\nThe 25 to 29 age group had the highest LFPR in 2009. Ten years later in 2019, the age group with the highest LFPR was 30 to 34.\r\n2\r\nThe largest increase in LFPR from 2009 to 2019 is amongst the 50 to 64, and 65 to 69 age groups. This is expected of a an ageing population.\r\n3\r\nOf all the LFPR age groups, only the 20 to 24 age group declined in LFPR from 2009 to 2019. This is the only exception amongst all the LFPR age groups.\r\n4\r\n4. The lower the age group, the lower the increase in LFPR from 2009 to 2019, with the exception of the 15 to 19 age group, which seemed to reverse the trend compared to the next older age group. This seems to contradict Singapore’s Total Fertility Rate (TFR) which has been declining consistently, but may have been bolstered by the slight up-tick in TFR in 2000.\r\nThank you for visiting my blog!\r\n Distill is a publication format for scientific and technical writing, native to the web. Learn more about using Distill at https://rstudio.github.io/distill. \r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-01-26T13:25:21+08:00",
    "input_file": {}
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to NetlifyBlog",
    "description": "Welcome to our new blog, NetlifyBlog. We hope you enjoy \nreading what we have to say!",
    "author": [
      {
        "name": "Nora Jones",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-01-26",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-01-26T13:27:01+08:00",
    "input_file": {}
  }
]
